import PageTitle from "@/components/page-title";

const PolicyPage = () => {
  return (
    <div className="container text-lg">
      <PageTitle>ভূমিকা</PageTitle>
      <div dir="rtl">
        <p>نحمدهونصلي علي رسولهالكريم، أما بعد!</p>
      </div>
      <p>
        মহান রব্বুল আলামীন আমাদের এবং সকল সৃষ্টিজীবের স্রষ্টা। তিনি আমাদেরকে
        পৃথিবীতে ‎পাঠিয়েছেন একমাত্র তাঁরই ইবাদতের মাধ্যমে তাঁকে চেনার জন্য।
        আল্লাহ তাআ‘লা ইরশাদ করেন-
      </p>
      <p dir="rtl">وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونَ</p>
      <p>
        আমার ইবাদত করার জন্যই আমি মানব ও জ্বীনজাতি সৃষ্টি করেছি।(যারিয়াত- ৫৬)
      </p>
      <p>
        এই দুনিয়াকে তিনি আমাদের ‎জন্য আখেরাতের ক্ষেত্র বানিয়েছেন। আমরা যদি
        আমাদের দুনিয়ার জীবনকে আল্লাহর হুকুম ও ‎নবী করীম (স.) এর তরিকায় পরিচালিত
        করতে পারি, তবেই তা ইবাদত বলে গণ্য হবে এবং তার মাধ্যমে আমরা আখেরাতে সফল
        হতে পারবো। ইন শা আল্লাহ।
      </p>
      <p>
        বলাবাহুল্য যে, ‎ইবাদত শুধু নামাজ, রোজা, হজ ও যাকাত এই কয়েকটি আমলের মধ্যে
        সীমাবদ্ধ নয়। বরং ‎জীবনের প্রতিটি মূহুর্তে প্রতিটি বিষয়কে আল্লাহর হুকুম
        অনুযায়ী চালানোই হচ্ছে ইবাদত।{" "}
      </p>
      <p>
        আল্লাহপাক ‎যেমন আমাদের জীবন দান করছেন, তেমনই জীবনপোকরণও সৃষ্টি করেছেন।
        সেগুলোকে তিনি পবিত্র কুরআন পাকে নেয়ামত, ‎দয়া, অনুগ্রহ প্রভৃতি দ্বারা
        অভিহিত করেছেন এবং তা উপার্জনের বিধান বর্ণনা করতঃ তার ‎প্রতি মানুষকে
        উদ্বুদ্ধ করার জন্য ফযিলতও বর্ণনা করেছেন। যা দ্বারা স্পষ্টতই প্রতীয়মান হয়
        যে, জীবন প্রবাহের গুরুত্বপূর্ণ অংশ হচ্ছে রুজি- রোজগার এবং তা ইবাদতও বটে।
        তাই তো এই বিষয়ে আল্লাহ পাক ও তাঁর নবী মুহাম্মাদ (সা.) এর বহু
        দিক-নির্দেশনা কুরআন-হাদীসে বর্ণিত হয়েছে। আল্লাহপাক ইরশাদ করেন-
      </p>
      <p>وأحل الله البيع وحرم الربا </p>
      <p>
        “আল্লাহ ব্যবসাকে হালাল করেছেন এবং সূদকে করেছেন হারাম”‎ (সুরা বাকারা ২২৭)
      </p>
      <p>নবী করীম (সা.) এর বাণী-</p>
      <p dir="rtl">
        عَنْ عَبْدِ اللّٰهِ بْنِ مَسْعُودٍ قَالَ : قَالَ رَسُوْلُ اللّٰهِ ﷺ :
        «طَلَبُ كَسْبِ الْحَلَالِ فَرِيضَةٌ بَعْدَ الْفَرِيضَةِ». رَوَاهُ
        الْبَيْهَقِىُّ فِيْ شُعَبِ الْإِيْمَانِ
      </p>
      <p>
        ‘আব্দুল্লাহ ইবনু মাস‘ঊদ হতে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু
        আলাইহি ওয়াসাল্লাম বলেছেন- অন্যান্য ফরয কাজ আদায়ের সাথে হালাল
        রুজি-রোজগারের ব্যবস্থা গ্রহণ করাও একটি ফরয। (বায়হাক্বী- শু‘আবুল ঈমান-
        ২৭৮১)
      </p>
      <p>অন্যত্র আল্লাহপাক আরো বলেন-</p>
      <p dir="rtl">
        ‎ فَاِذَا قُضِیَتِ الصَّلٰوۃُ فَانۡتَشِرُوۡا فِيْ الۡأرۡضِ وَ ابۡتَغُوۡا
        مِنۡ فَضۡلِ اللّٰہِ‎ ‎
      </p>
      <p>
        অতঃপর যখন সালাত সমাপ্ত হবে তখন তোমরা পৃথিবীতে ছড়িয়ে পড় আর ‎আল্লাহর
        অনুগ্রহ হতে অনুসন্ধান কর ‎। (সুরা জুমআহ-১০) উল্লেখ্য যে, এখানে “আল্লাহর
        অনুগ্রহ” দ্বারা উদ্দেশ্য হলো, বৈধভাবে জীবনপোকরণের ‎সন্ধানের বেরিয়ে পড়া।
      </p>
      <p>অন্যত্র আরো ইরশাদ হচ্ছে-</p>
      <p dir="rtl">
        هُوَ الَّذِي جَعَلَ لَكُمْ الْأَرْضَ ذَلُولًا فَامْشُوا فِي مَنَاكِبِهَا
        وَكُلُوا مِنْ رِزْقِهِ وَإِلَيْهِ النُّشُورُ{" "}
      </p>
      <p>
        তিনিই তো তোমাদের জন্য যমীনকে সুগম করে দিয়েছেন, কাজেই তোমরা এর
        পথে-প্রান্তরে বিচরণ কর এবং তাঁর রিযিক থেকে তোমরা আহার কর। আর তাঁর নিকটই
        পুনরুত্থান। (সুরা মুলক-১৫) এছাড়াও‎ পবিত্র হাদীসে পাকে ব্যবসা ও হালাল
        উপার্জনের বহু গুরুত্ব ও ফযিলত বর্ণিত হয়েছে। এখানে দু‘একটি উল্লেখ করা
        হলো।
      </p>
      <p>নবী করীম (স.) ‎ইরশাদ করেন-</p>
      <p dir="rtl">
        عن أبي سعيد الخدري -رضي الله عنه- عن النبي- صَلَّى اللَّهُ عَلَيْهِ
        وَسَلَّمَ- قال: التاجر الصدوق الأمين مع النبيين والصديقين والشهداء.
      </p>
      <p>
        বিশ্বস্ত ও সত্যবাদী ব্যবসায়ীগণের হাশর হবে নবীগণ, সিদ্দীকগণ এবং শহীদগণের
        ‎সাথে। (তিরমীযী)
      </p>
      <p>অন্য এক হাদিসে বর্ণিত হয়েছে-</p>
      <p dir="rtl">
        عَنِ الْمِقْدَامِ -رضي الله عنه- عَنْ رَسُولِ اللَّهِ -صلى الله عليه-
        وسلم قَالَ:‏ مَا أَكَلَ أَحَدٌ طَعَامًا قَطُّ خَيْرًا مِنْ أَنْ يَأْكُلَ
        مِنْ عَمَلِ يَدِهِ، وَإِنَّ نَبِيَّ اللَّهِ دَاوُدَ -عَلَيْهِ
        السَّلاَمُ- كَانَ يَأْكُلُ مِنْ عَمَلِ يَدِهِ ‏‏‏.‏
      </p>
      <p>
        মিকদাম (রা.) থেকে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি
        ওয়াসাল্লাম বলেছেন, নিজ হাতে উপার্জিত জীবিকার খাদ্যের চেয়ে উত্তম খাদ্য
        কখনো কেউ খায়না। আল্লাহর নবী দাউদ (আলাইহিস সালাম) নিজ হাতে উপার্জন করে
        খেতেন। (বুখারী ১৯৪২)
      </p>
      <p>
        কুরআন সুন্নাহের এই গুরুত্বপূর্ণ নির্দেশনার উপর আমল করার উদ্দেশ্যে আমাদের
        এই ‎ক্ষুদ্র প্রয়াস-
      </p>
      <p>
        কিছু লক্ষকে সামনে রেখে ‘আল খায়ের ফাউন্ডেশন’ এর উদ্যোগে পরিবারের বিজ্ঞ
        উলামায়ে কেরাম ও মুরব্বীদের ‎নির্দেশনা এবং পরামর্শে গঠিত হয়েছে আল খায়ের
        উন্নয়ন ও কল্যাণ সমিতি”‎ (যার নীতিমালা নিম্নে প্রদত্ত হয়েছে) এভাবে আমরা
        যদি হালাল রুজি কামাইয়ের মাধ্যমে স্বাবলম্বী হতে পারি এবং ‘খিদমাতে খালক’
        এর কাজে এগিয়ে আসতে পারি, ইনশাআল্লাহ তিনি আমাদেরকে অপদস্ত ‎করবেন না।
        কারণ, ‎ নবী করীম (স.) এর মাঝে মানব সেবার যেই গুণগুলোর কথা বিশেষভাবে
        উল্লেখ ‎হয়েছে, যার কারণে তাঁর সফলতার নিশ্চয়তা দেওয়া হয়েছে। বুখারী শরীফের
        শুরুর ‎দিকে বর্ণিত হয়েছে-‎
      </p>
      <p dir="rtl">
        كَلاَّ وَاللَّهِ مَا يُخْزِيكَ اللَّهُ أَبَدًا، إِنَّكَ لَتَصِلُ
        الرَّحِمَ، وَتَحْمِلُ الْكَلَّ، وَتَكْسِبُ ‏الْمَعْدُومَ، وَتَقْرِي
        الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ‏.‏
      </p>
      <p>
        তখন তিনি (নবীজী) খাদীজা (রা.) এর কাছে সকল ঘটনা জানিয়ে তাঁকে ‎বললেন, আমি
        নিজের উপর আশঙ্কা বোধ করছি। খাদীজা (রা.) বললেন, ‎আল্লাহ্‌র কসম, কক্ষনো
        না। আল্লাহ্ আপনাকে কক্ষনো অপমানিত করবেন ‎না। আপনিতো আত্মীয়-স্বজনের সাথে
        সদ্ব্যবহার করেন, অসহায় দুর্বলের ‎দায়িত্ব বহন করেন, নিঃস্বকে সাহায্য
        করেন, মেহমানের মেহমানদারী করেন ‎এবং দুর্দশাগ্রস্তকে সাহায্য করেন।
      </p>
      <p>
        নবীজীর উম্মত ও অনুসারী হিসেবে আমাদেরও উচিত মানব সেবায় এগিয়ে ‎আসা। তবেই
        আমরা আশাকরি ইহ ও পরকালে সফল হতে পারবো। ‎ইনশাআল্লাহ। আল্লাহ আমাদের তাওফীক
        দান করুন। আামীন
      </p>

      <PageTitle>নীতিমালা</PageTitle>
      <ul>
        <li>
          ১. ইবাদতের নিয়তে হালাল উপায়ে আর্থিকভাবে স্বাবলম্বী হওয়ার নিয়তে সদস্য
          হতে হবে।
        </li>
        <li>২. কুরআন সুন্নাহ বিরোধী কোন বিষয়কে প্রশ্রয় দেওয়া হবেনা। </li>
        <li>৩. কেউ কোনরূপ সুদি কারবারের চিন্তাও করবে না।</li>
        <li>৪. প্রতি মাসে যার যার নির্ধারিত টাকা যথা সময়ে পরিশোধ করতে হবে।</li>
        <li>
          ৫. সর্বনিম্ন এক শেয়ার নিয়ে সদস্য হতে পারবে এবং যত ইচ্ছা তত শেয়ার গ্রহণ
          করতে পারবে। প্রতি ‎শেয়ারের পরিমাণ ১৫০০/= (পনেরশত টাকা)
        </li>
        <li>
          ৬. যথা সময়ে নির্ধারিত টাকা দিতে না পারলে দায়িত্বশীলদেরকে অবগত করবে।
        </li>
        <li>
          ৭. পরপর দুই মাস নির্ধারিত টাকা না দিলে সে সমিতির আইন লঙ্ঘনকারী হিসেবে
          বিবেচিত হবে।
        </li>
        <li>৮. নতুন সদস্য হলে জুলাই ২০২৪ঈ. হতে বিগত মাসের টাকাসহ দিতে হবে।</li>
        <li>
          ৯. কমিটির দায়িত্বশীলগণ কাউকে সদস্য হিসেবে গ্রহণ ও বাদ দেওয়ার অধিকার
          সংরক্ষণ করবেন।
        </li>
        <li>
          ১০. সদস্যদের জমাকৃত অর্থ সকল সদস্যদের পরামর্শক্রমে বিনিয়োগ করা হবে।
          এবং পরামর্শ মোতাবেক ‎নির্ধারিত সময়ে লভ্যাংশ অনুপাতিক হারে ভাগ করে
          দেওয়া হবে।
        </li>
        <li>১১. আমাদের সহপাঠী ছাড়া অন্য কেউ সমিতির ‎সদস্য হতে পারবে না। ‎</li>
        <li>
          ১২. কোন সদস্যের কারণে সমিতিতে বিশৃঙ্খলা দেখা দিলে সকল সদস্যের মতামতের
          ভিত্তিতে উক্ত সদস্যকে ‎সমিতি থেকে অব্যহতি দেয়ার ক্ষমতা সমিতির থাকবে।
        </li>
        <li>১৩. সমিতির অর্থ কোন সদস্যকে লোন বা ধার হিসেবে দেয়া হবে না।</li>
        <li>
          ১৪. একান্ত প্রয়োজন হলে নিজের অংশ পরিমাণ লোন নিতে পারবে। বেশির জন্য কেউ
          সুপারিশ করলে ‎সুপারিশকারীকে জামিন হতে হবে এবং সুপারিশকারীর অংশ পরিমাণ
          লোন পাবে।
        </li>
        <li>
          ১৫. সমিতির টাকা সমিতির যৌথ একাউন্টে জমা রাখতে হবে। নিজের কাছে রাখা
          যাবেনা।
        </li>
        <li>
          ১৬. দায়িত্বশীলগণের কারো দ্বারা আর্থিক কোন অনিয়ম হলে সকল দায়িত্বশীল
          জবাবদিহিতা এবং ‎সমস্যা সমাধান করে সকলের অধিকার বুঝিয়ে দিতে বাধ্য
          থাকবেন।
        </li>
        <li>
          ১৭. সদস্যগণ ক্যাশিয়ারের কাছে যে কোন সময় সমিতির বতর্মান হিসাব নিকাশ
          চাইতে পারবে এবং ‎ক্যাশিয়ার তা দিতে বাধ্য থাকবেন।
        </li>
        <li>
          ১৮. ক্যাশিয়ার প্রতি মাস শেষে সমিতির বতর্মান অবস্থা সদস্যগণের নিকট তুলে
          ধরবে। সমিতির নির্ধারিত সময় ছাড়া সমিতি থেকে কেউ চলে যেতে চাইলে শুধু তার
          জমাকৃত অর্থ ফেরত পাবে কিন্তু ‎বিনিয়োগের লাভের কোন অংশ পাবে না। সমিতি
          তার এই জমাকৃত অর্থ সে সমিতি থেকে চলে যাওয়ার ‎যাওয়ার তিনমাসের মধ্যে
          পরিশোধ করবে।
        </li>
        <li>
          ১৯. এক বছর পর যদি কোন সদস্য সমিতি থেকে চলে যায়। তাহলে তার জমাকৃত অর্থ
          তাকে ফেরত দেয়া ‎হবে। তবে সে সদস্য সমিতি থেকে চলে যাওয়ার বিষয়ে ৩ মাস
          আগে সমিতিকে অবগত করতে হবে।
        </li>
        <li>
          ২০. সমিতির সদস্যগণের মতামতের ভিত্তিতে নতুন কোন নিয়ম সমিতি যোগ করতে
          পারবে। সমিতির প্রতি সদস্যগণের আস্থা রাখতে হবে।।
        </li>
        <li>
          ২১. যে কোন সদস্য অগ্রিম চাঁদা প্রদান করতে পারবে। তবে তার টাকা বিনিয়োগ
          না হওয়ার আগে লভ্যাংশ ‎পাবে না।
        </li>
        <li>
          ২২. সমিতির বিরুদ্ধে কোন ষড়যন্ত্র হলে সকলে সম্মিলিতভাবে তা প্রতিহত করতে
          হবে।
        </li>
        <li>
          ২৩. এই সমিতি সহপাঠীদের এক প্লাটফরমে আসার অন্যতম মাধ্যম। তাই সকলেই
          সম্মিলিতভাবে ‎দ্বীনি ও সামাজিক কাজে অংশগ্রহণে সচেষ্ট থাকবে। ‎
        </li>
        <li>
          ২৪. সমিতির কল্যাণে বা সমিতির উদ্যোগে মিটিং কল করা হলে বা কোন আয়োজন করা
          হলে সকলে ‎তাতে অংশগ্রহণে সচেষ্ট থাকবে।
        </li>
        <li>
          ২৫. সমিতির নামে যৌথ একাউন্ট থাকবে, এবং যৌথ স্বাক্ষর ছাড়া টাকা উত্তোলন
          করা যাবে না।
        </li>
        <li>২৬. সমিতির উদ্যোগে ইলমী ও আমলী তারাক্কীর ফিকির করতে হবে।</li>
        <li>
          আমি উপরোক্ত নিয়মাবলী মেনে উক্ত সমিতির একজন সদস্য হওয়ার ইচ্ছা পোষণ করে
          অংশগ্রহণ করলাম।
        </li>
      </ul>
    </div>
  );
};

export default PolicyPage;
