import { Feather, HandHeart, Users } from "lucide-react";
import investmentImageType1 from "@/assets/shop.jpg";
import investmentImageType2 from "@/assets/honey.jpg";
import investmentImageType3 from "@/assets/cng.jpg";
import investmentImageType4 from "@/assets/marriage.jpg";
import logo from "@/assets/logo.png";

// export const organizationInfo = {
//   name: "মারকাজুন নূর ফাউন্ডেশন",
//   badge: "আর্থিক উন্নয়ন, সেবা ও কল্যাণ মূলক একটি অরাজনৈতিক সংস্থা",
//   logo: logo,
//   description:
//     "মার্কাজুন নূর একটি আর্থিক সংগঠন যা গঠন করা হয়েছে ২০২৫ সালের জানুয়ারি মাস থেকে আমাদের একমাত্র লক্ষ্য হালাল ও বৈধ পন্থায় মুনাফা লাভ",

//   // Goal:
//   goal: {
//     title: "আমাদের লক্ষ্য ও উদ্দেশ্য",
//     description:
//       "মার্কাজুন নূর একটি আর্থিক সংগঠন যা গঠন করা হয়েছে ২০২৫ সালের জানুয়ারি মাস থেকে আমাদের একমাত্র লক্ষ্য হালাল ও বৈধ পন্থায় মুনাফা লাভ",
//     types: [
//       {
//         title: "হালাল বিনিয়োগ",
//         icon: <HandHeart />,
//         description:
//           "আমাদের লক্ষ্য হলো শরীয়াহ্ ভিত্তিক বিনিয়োগের সুযোগ সৃষ্টি করে একটি ন্যায়ভিত্তিক ও কল্যাণমুখী অর্থনৈতিক পরিবেশ গড়ে তোলা। আমরা নিরাপদ ও হালাল খাতে বিনিয়োগের মাধ্যমে সদস্যদের সঞ্চয়কে অর্থবহ এবং লাভজনকভাবে কাজে লাগানোর পথ উন্মুক্ত করি। প্রতিটি বিনিয়োগ ব্যবস্থা ইসলামী অর্থনীতির মূলনীতি অনুযায়ী যাচাই-বাছাই করে গ্রহণ করা হয়, যাতে কেউ সুদ বা সন্দেহজনক উপায়ে সম্পৃক্ত না হন।",
//       },
//       {
//         title: "সদস্যদের কল্যাণ",
//         icon: <Users />,
//         description:
//           "আমরা বিশ্বাস করি, একটি সমাজ তখনই দৃঢ় হয় যখন সদস্যদের মধ্যে সহমর্মিতা, সহযোগিতা ও নিরাপত্তাবোধ প্রতিষ্ঠিত হয়। আমাদের সদস্যদের জন্য আমরা বিভিন্ন কল্যাণমূলক কর্মসূচি পরিচালনা করি, যার মাধ্যমে স্বাস্থ্য, শিক্ষা, বাসস্থান ও জরুরি আর্থিক সহায়তা প্রদান করা হয়। এ সকল পদক্ষেপের মাধ্যমে আমরা সদস্যদের জীবনযাত্রার মান উন্নত করতে কাজ করে যাচ্ছি।",
//       },
//       {
//         title: "ইসলামিক মূল্যবোধ",
//         icon: <Feather />,
//         description:
//           "আমরা ইসলামী আদর্শ ও মূল্যবোধকে জীবনের প্রতিটি ক্ষেত্রে বাস্তবায়নের জন্য অনুপ্রাণিত করি। আমাদের কর্মপ্রচেষ্টার মাধ্যমে সদস্যদের মাঝে দীনী জ্ঞান বৃদ্ধি, সামাজিক দায়িত্ববোধ, নৈতিকতা এবং আত্মশুদ্ধির গুরুত্ব তুলে ধরা হয়। পাশাপাশি, ইসলামী শিক্ষার প্রসারে পাঠচক্র, কর্মশালা এবং দাওয়াতি কার্যক্রম পরিচালনা করে থাকি।",
//       },
//     ],
//   },

//   // Investment
//   investment: {
//     title: "সম্পূর্ণ সুদমুক্ত হালাল পন্থায় আমাদের বিনিয়োগ কাজ চলমান।",
//     badge: "হালাল বিনিয়োগ",
//     types: [
//       {
//         title: "আপনার দোকান",
//         description: "আপনার দোকানের জন্য বিনিয়োগ নিন।",
//         background: investmentImageType1,
//       },
//       {
//         title: "আপনার দোকান",
//         description: "আপনার দোকানের জন্য বিনিয়োগ নিন।",
//         background: investmentImageType2,
//       },
//       {
//         title: "স্বাবলম্বীকরণ ঋণ",
//         description: "নিজের জন্য গাড়ি নিন।",
//         background: investmentImageType3,
//       },
//       {
//         title: "বিবাহ ঋণ",
//         description: "বিবাহকে সহসলভ্য করার প্রচেষ্টা",
//         background: investmentImageType4,
//       },
//     ],
//   },

//   // Summary
//   summary: {
//     title: "আর্থিক সারাংশ",
//     badge: "মারকাজুন নূর ফাউন্ডেশন বর্তমান আর্থিক অবস্থা ও পরিসংখ্যান",
//     description:
//       "হালাল উপার্জন ও শরিয়াহ সম্মত বিনিয়োগের মাধ্যমে আমরা গড়ে তুলতে চাই একটি আত্মনির্ভরশীল মুসলিম সম্প্রদায়। যেখানে থাকবে পারস্পরিক সহযোগিতা, আর্থিক স্বচ্ছতা ও ইসলামিক মূল্যবোধের চর্চা।",
//   },

//   // Policy
//   policy: {
//     title: "সংগঠনের নীতিমালা",
//     badge: "সংগঠনের গঠনতন্ত্র ও পরিচালনা সংক্রান্ত নীতিমালা",
//     description:
//       "সংগঠনের নীতিমালা সবার জন্য সবসময় ভালোভাবে লক্ষ্য রাখা অত্যান্ত গুরুত্বপূর্ণ। নতুনভাবে সংগঠনের সাথে সংযুক্ত হতে নিম্নোক্ত সকল নিয়মাবলী সম্পূর্ণরূপে মেনে নেওয়ার শর্তেই কেবল জয়েন করতে পারবে।",
//     subTitle: "গঠনতন্ত্র ও পরিচালনা সংক্রান্ত বিধি-বিধান",
//     subDescription:
//       "সংগঠনের নীতিমালা সবার জন্য সবসময় ভালোভাবে লক্ষ্য রাখা অত্যান্ত গুরুত্বপূর্ণ। নতুনভাবে সংগঠনের সাথে সংযুক্ত হতে নিম্নোক্ত সকল নিয়মাবলী সম্পূর্ণরূপে মেনে নেওয়ার শর্তেই কেবল জয়েন করতে পারবে।",
//   },

//   // Developer
//   developer: {
//     name: "রাশেদ আব্দুল্লাহ",
//     socials: [
//       { name: "Website", link: "https://rashedabdullah.com" },
//       { name: "Linkedin", link: "https://www.linkedin.com/in/rashed4abdullah" },
//       { name: "Facebook", link: "https://www.facebook.com/Rashed4Abdullah" },
//       { name: "Github", link: "https://github.com/RashedAbdullah" },
//     ],
//   },
// };

export const organizationInfo = {
  name: "সিহাবুল খায়ের",
  badge: "(ঐক্য, সম্প্রীতি ও শান্তি প্রতিষ্ঠার প্রত্যয়ে)",
  logo: logo,
  description:
    "সিহাবুল খায়ের একটি আর্থিক সংগঠন যা গঠন করা হয়েছে জামিয়া মাদানিয়া সিলোনিয়া ২০২০-২১ মেশকাত ব্যাচের স্বেচ্ছাপ্রণোদিত কিছু ছাত্রের মাধ্যমে। আমাদের একমাত্র লক্ষ্য হালাল ও বৈধ পন্থায় মুনাফা লাভ অথবা সার্বিক সমঝোতায় নির্দিষ্ট খাতে ব্যয়।",

  // Goal:
  goal: {
    title: "আমাদের লক্ষ্য ও উদ্দেশ্য",
    description:
      "শরিয়াহ সম্মত পন্থায় অর্থনৈতিক কর্মকাণ্ড পরিচালনা করা ও সদস্যদের মধ্যে পারস্পরিক সহযোগিতা ও আর্থিক নিরাপত্তা নিশ্চিত করা ও সলামিক শিক্ষা ও দাওয়াতের কাজে সহায়তা প্রদান",
    types: [
      {
        title: "হালাল বিনিয়োগ",
        icon: <HandHeart />,
        description:
          "আমাদের লক্ষ্য হলো শরীয়াহ্ ভিত্তিক বিনিয়োগের সুযোগ সৃষ্টি করে একটি ন্যায়ভিত্তিক ও কল্যাণমুখী অর্থনৈতিক পরিবেশ গড়ে তোলা। আমরা নিরাপদ ও হালাল খাতে বিনিয়োগের মাধ্যমে সদস্যদের সঞ্চয়কে অর্থবহ এবং লাভজনকভাবে কাজে লাগানোর পথ উন্মুক্ত করি। প্রতিটি বিনিয়োগ ব্যবস্থা ইসলামী অর্থনীতির মূলনীতি অনুযায়ী যাচাই-বাছাই করে গ্রহণ করা হয়, যাতে কেউ সুদ বা সন্দেহজনক উপায়ে সম্পৃক্ত না হন।",
      },
      {
        title: "সদস্যদের কল্যাণ",
        icon: <Users />,
        description:
          "আমরা বিশ্বাস করি, একটি সমাজ তখনই দৃঢ় হয় যখন সদস্যদের মধ্যে সহমর্মিতা, সহযোগিতা ও নিরাপত্তাবোধ প্রতিষ্ঠিত হয়। আমাদের সদস্যদের জন্য আমরা বিভিন্ন কল্যাণমূলক কর্মসূচি পরিচালনা করি, যার মাধ্যমে স্বাস্থ্য, শিক্ষা, বাসস্থান ও জরুরি আর্থিক সহায়তা প্রদান করা হয়। এ সকল পদক্ষেপের মাধ্যমে আমরা সদস্যদের জীবনযাত্রার মান উন্নত করতে কাজ করে যাচ্ছি।",
      },
      {
        title: "ইসলামিক মূল্যবোধ",
        icon: <Feather />,
        description:
          "আমরা ইসলামী আদর্শ ও মূল্যবোধকে জীবনের প্রতিটি ক্ষেত্রে বাস্তবায়নের জন্য অনুপ্রাণিত করি। আমাদের কর্মপ্রচেষ্টার মাধ্যমে সদস্যদের মাঝে দীনী জ্ঞান বৃদ্ধি, সামাজিক দায়িত্ববোধ, নৈতিকতা এবং আত্মশুদ্ধির গুরুত্ব তুলে ধরা হয়। পাশাপাশি, ইসলামী শিক্ষার প্রসারে পাঠচক্র, কর্মশালা এবং দাওয়াতি কার্যক্রম পরিচালনা করে থাকি।",
      },
    ],
  },

  // Investment
  investment: {
    title: "সম্পূর্ণ সুদমুক্ত হালাল পন্থায় আমাদের বিনিয়োগ কাজ চলমান।",
    badge: "হালাল বিনিয়োগ",
    types: [
      {
        title: "আপনার দোকান",
        description: "আপনার দোকানের জন্য বিনিয়োগ নিন।",
        background: investmentImageType1,
      },
      {
        title: "আপনার দোকান",
        description: "আপনার দোকানের জন্য বিনিয়োগ নিন।",
        background: investmentImageType2,
      },
      {
        title: "স্বাবলম্বীকরণ ঋণ",
        description: "নিজের জন্য গাড়ি নিন।",
        background: investmentImageType3,
      },
      {
        title: "বিবাহ ঋণ",
        description: "বিবাহকে সহসলভ্য করার প্রচেষ্টা",
        background: investmentImageType4,
      },
    ],
  },

  // Summary
  summary: {
    title: "আর্থিক সারাংশ",
    badge: "সিহাবুল খায়ের এর বর্তমান আর্থিক অবস্থা ও পরিসংখ্যান",
    description:
      "হালাল উপার্জন ও শরিয়াহ সম্মত বিনিয়োগের মাধ্যমে আমরা গড়ে তুলতে চাই একটি আত্মনির্ভরশীল মুসলিম সম্প্রদায়। যেখানে থাকবে পারস্পরিক সহযোগিতা, আর্থিক স্বচ্ছতা ও ইসলামিক মূল্যবোধের চর্চা।",
  },

  // Policy
  policy: {
    title: "সংগঠনের নীতিমালা",
    badge: "সংগঠনের গঠনতন্ত্র ও পরিচালনা সংক্রান্ত নীতিমালা",
    description:
      "সংগঠনের নীতিমালা সবার জন্য সবসময় ভালোভাবে লক্ষ্য রাখা অত্যান্ত গুরুত্বপূর্ণ। নতুনভাবে সংগঠনের সাথে সংযুক্ত হতে নিম্নোক্ত সকল নিয়মাবলী সম্পূর্ণরূপে মেনে নেওয়ার শর্তেই কেবল জয়েন করতে পারবে।",
    subTitle: "গঠনতন্ত্র ও পরিচালনা সংক্রান্ত বিধি-বিধান",
    subDescription:
      "সংগঠনের নীতিমালা সবার জন্য সবসময় ভালোভাবে লক্ষ্য রাখা অত্যান্ত গুরুত্বপূর্ণ। নতুনভাবে সংগঠনের সাথে সংযুক্ত হতে নিম্নোক্ত সকল নিয়মাবলী সম্পূর্ণরূপে মেনে নেওয়ার শর্তেই কেবল জয়েন করতে পারবে।",
  },

  // Developer
  developer: {
    name: "রাশেদ আব্দুল্লাহ",
    socials: [
      { name: "Website", link: "https://rashedabdullah.com" },
      { name: "Linkedin", link: "https://www.linkedin.com/in/rashed4abdullah" },
      { name: "Facebook", link: "https://www.facebook.com/Rashed4Abdullah" },
      { name: "Github", link: "https://github.com/RashedAbdullah" },
    ],
  },
};
